espressif/esp-idf/components/soc/esp32s31/register/soc/pvt_reg.h
/** PVT_BYPASS_CHAIN_REG register
 *  needs field desc
 */
#define PVT_BYPASS_CHAIN_REG (DR_REG_PVT_BASE + 0x1ec)
/** PVT_CLK_CHAIN_EN : R/W; bitpos: [31:0]; default: 4294967295;
 *  needs field desc
 */
#define PVT_CLK_CHAIN_EN    0xFFFFFFFFU
#define PVT_CLK_CHAIN_EN_M  (PVT_CLK_CHAIN_EN_V << PVT_CLK_CHAIN_EN_S)
#define PVT_CLK_CHAIN_EN_V  0xFFFFFFFFU
#define PVT_CLK_CHAIN_EN_S  0

/** PVT_DLY_NUM_REC0_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC0_REG (DR_REG_PVT_BASE + 0x1f0)
/** PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD_M  (PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD_V << PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT0_MAX_RECORD_S  0
/** PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD_M  (PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD_V << PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT1_MAX_RECORD_S  8
/** PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD_M  (PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD_V << PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT2_MAX_RECORD_S  16
/** PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD_M  (PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD_V << PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT3_MAX_RECORD_S  24

/** PVT_DLY_NUM_REC1_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC1_REG (DR_REG_PVT_BASE + 0x1f4)
/** PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD_M  (PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD_V << PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT0_MAX_RECORD_S  0
/** PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD_M  (PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD_V << PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT1_MAX_RECORD_S  8
/** PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD_M  (PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD_V << PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT2_MAX_RECORD_S  16
/** PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD_M  (PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD_V << PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT3_MAX_RECORD_S  24

/** PVT_DLY_NUM_REC2_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC2_REG (DR_REG_PVT_BASE + 0x1f8)
/** PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD_M  (PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD_V << PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT0_MAX_RECORD_S  0
/** PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD_M  (PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD_V << PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT1_MAX_RECORD_S  8
/** PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD_M  (PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD_V << PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT2_MAX_RECORD_S  16
/** PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD_M  (PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD_V << PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT3_MAX_RECORD_S  24

/** PVT_DLY_NUM_REC3_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC3_REG (DR_REG_PVT_BASE + 0x1fc)
/** PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD_M  (PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD_V << PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT0_MAX_RECORD_S  0
/** PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD_M  (PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD_V << PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT1_MAX_RECORD_S  8
/** PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD_M  (PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD_V << PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT2_MAX_RECORD_S  16
/** PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD_M  (PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD_V << PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT3_MAX_RECORD_S  24

