espressif/esp-idf/components/soc/esp32s31/register/soc/pvt_reg.h
/** PVT_DLY_NUM_REC4_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC4_REG (DR_REG_PVT_BASE + 0x200)
/** PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD_M  (PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD_V << PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT0_MIN_RECORD_S  0
/** PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD_M  (PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD_V << PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT1_MIN_RECORD_S  8
/** PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD_M  (PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD_V << PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT2_MIN_RECORD_S  16
/** PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD    0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD_M  (PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD_V << PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD_S)
#define PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD_V  0x000000FFU
#define PVT_SITE0_DELAY_NUM_VT3_MIN_RECORD_S  24

/** PVT_DLY_NUM_REC5_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC5_REG (DR_REG_PVT_BASE + 0x204)
/** PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD_M  (PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD_V << PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT0_MIN_RECORD_S  0
/** PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD_M  (PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD_V << PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT1_MIN_RECORD_S  8
/** PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD_M  (PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD_V << PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT2_MIN_RECORD_S  16
/** PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD    0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD_M  (PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD_V << PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD_S)
#define PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD_V  0x000000FFU
#define PVT_SITE1_DELAY_NUM_VT3_MIN_RECORD_S  24

/** PVT_DLY_NUM_REC6_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC6_REG (DR_REG_PVT_BASE + 0x208)
/** PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD_M  (PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD_V << PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT0_MIN_RECORD_S  0
/** PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD_M  (PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD_V << PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT1_MIN_RECORD_S  8
/** PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD_M  (PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD_V << PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT2_MIN_RECORD_S  16
/** PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD    0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD_M  (PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD_V << PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD_S)
#define PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD_V  0x000000FFU
#define PVT_SITE2_DELAY_NUM_VT3_MIN_RECORD_S  24

/** PVT_DLY_NUM_REC7_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC7_REG (DR_REG_PVT_BASE + 0x20c)
/** PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD : RO; bitpos: [7:0]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD_M  (PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD_V << PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT0_MIN_RECORD_S  0
/** PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD : RO; bitpos: [15:8]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD_M  (PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD_V << PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT1_MIN_RECORD_S  8
/** PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD : RO; bitpos: [23:16]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD_M  (PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD_V << PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT2_MIN_RECORD_S  16
/** PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD : RO; bitpos: [31:24]; default: 0;
 *  needs field desc
 */
#define PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD    0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD_M  (PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD_V << PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD_S)
#define PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD_V  0x000000FFU
#define PVT_SITE3_DELAY_NUM_VT3_MIN_RECORD_S  24

/** PVT_DLY_NUM_REC_CLR_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_REC_CLR_REG (DR_REG_PVT_BASE + 0x210)
/** PVT_DELAY_NUM_REC_CLR : WT; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_REC_CLR    (BIT(0))
#define PVT_DELAY_NUM_REC_CLR_M  (PVT_DELAY_NUM_REC_CLR_V << PVT_DELAY_NUM_REC_CLR_S)
#define PVT_DELAY_NUM_REC_CLR_V  0x00000001U
#define PVT_DELAY_NUM_REC_CLR_S  0

/** PVT_DLY_NUM_DUMP_CONF_REG register
 *  needs field desc
 */
#define PVT_DLY_NUM_DUMP_CONF_REG (DR_REG_PVT_BASE + 0x214)
/** PVT_DUMP_EN : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_DUMP_EN    (BIT(0))
#define PVT_DUMP_EN_M  (PVT_DUMP_EN_V << PVT_DUMP_EN_S)
#define PVT_DUMP_EN_V  0x00000001U
#define PVT_DUMP_EN_S  0
/** PVT_DUMP_CELL_SEL : R/W; bitpos: [7:1]; default: 0;
 *  needs field desc
 */
#define PVT_DUMP_CELL_SEL    0x0000007FU
#define PVT_DUMP_CELL_SEL_M  (PVT_DUMP_CELL_SEL_V << PVT_DUMP_CELL_SEL_S)
#define PVT_DUMP_CELL_SEL_V  0x0000007FU
#define PVT_DUMP_CELL_SEL_S  1
/** PVT_DUMP_EOF_NUM : R/W; bitpos: [23:8]; default: 65535;
 *  needs field desc
 */
#define PVT_DUMP_EOF_NUM    0x0000FFFFU
#define PVT_DUMP_EOF_NUM_M  (PVT_DUMP_EOF_NUM_V << PVT_DUMP_EOF_NUM_S)
#define PVT_DUMP_EOF_NUM_V  0x0000FFFFU
#define PVT_DUMP_EOF_NUM_S  8

/** PVT_PWR_GLITCH_CONF_REG register
 *  needs field desc
 */
#define PVT_PWR_GLITCH_CONF_REG (DR_REG_PVT_BASE + 0x218)
/** PVT_GLITCH_EFUSE_CTRL : R/W; bitpos: [0]; default: 1;
 *  needs field desc
 */
#define PVT_GLITCH_EFUSE_CTRL    (BIT(0))
#define PVT_GLITCH_EFUSE_CTRL_M  (PVT_GLITCH_EFUSE_CTRL_V << PVT_GLITCH_EFUSE_CTRL_S)
#define PVT_GLITCH_EFUSE_CTRL_V  0x00000001U
#define PVT_GLITCH_EFUSE_CTRL_S  0
/** PVT_GLITCH_EN : R/W; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_GLITCH_EN    (BIT(1))
#define PVT_GLITCH_EN_M  (PVT_GLITCH_EN_V << PVT_GLITCH_EN_S)
#define PVT_GLITCH_EN_V  0x00000001U
#define PVT_GLITCH_EN_S  1
/** PVT_GLITCH_CELL_SEL : R/W; bitpos: [8:2]; default: 0;
 *  needs field desc
 */
#define PVT_GLITCH_CELL_SEL    0x0000007FU
#define PVT_GLITCH_CELL_SEL_M  (PVT_GLITCH_CELL_SEL_V << PVT_GLITCH_CELL_SEL_S)
#define PVT_GLITCH_CELL_SEL_V  0x0000007FU
#define PVT_GLITCH_CELL_SEL_S  2
/** PVT_GLITCH_LIMIT : R/W; bitpos: [24:9]; default: 255;
 *  needs field desc
 */
#define PVT_GLITCH_LIMIT    0x0000FFFFU
#define PVT_GLITCH_LIMIT_M  (PVT_GLITCH_LIMIT_V << PVT_GLITCH_LIMIT_S)
#define PVT_GLITCH_LIMIT_V  0x0000FFFFU
#define PVT_GLITCH_LIMIT_S  9

/** PVT_DBIAS_ACTIVE_TIME_REG register
 *  needs field desc
 */
#define PVT_DBIAS_ACTIVE_TIME_REG (DR_REG_PVT_BASE + 0x21c)
/** PVT_DBIAS_ACTIVE_TIME : R/W; bitpos: [31:0]; default: 65535;
 *  needs field desc
 */
#define PVT_DBIAS_ACTIVE_TIME    0xFFFFFFFFU
#define PVT_DBIAS_ACTIVE_TIME_M  (PVT_DBIAS_ACTIVE_TIME_V << PVT_DBIAS_ACTIVE_TIME_S)
#define PVT_DBIAS_ACTIVE_TIME_V  0xFFFFFFFFU
#define PVT_DBIAS_ACTIVE_TIME_S  0

/** PVT_DBIAS_IDLE_TIME_REG register
 *  needs field desc
 */
#define PVT_DBIAS_IDLE_TIME_REG (DR_REG_PVT_BASE + 0x220)
/** PVT_DBIAS_IDLE_TIME : R/W; bitpos: [31:0]; default: 4294967295;
 *  needs field desc
 */
#define PVT_DBIAS_IDLE_TIME    0xFFFFFFFFU
#define PVT_DBIAS_IDLE_TIME_M  (PVT_DBIAS_IDLE_TIME_V << PVT_DBIAS_IDLE_TIME_S)
#define PVT_DBIAS_IDLE_TIME_V  0xFFFFFFFFU
#define PVT_DBIAS_IDLE_TIME_S  0

/** PVT_DATE_REG register
 *  version register
 */
#define PVT_DATE_REG (DR_REG_PVT_BASE + 0xffc)
/** PVT_DATE : R/W; bitpos: [31:0]; default: 34677040;
 *  version register
 */
#define PVT_DATE    0xFFFFFFFFU
#define PVT_DATE_M  (PVT_DATE_V << PVT_DATE_S)
#define PVT_DATE_V  0xFFFFFFFFU
#define PVT_DATE_S  0

#ifdef __cplusplus
}
#endif
